#include "game/backend/Self.hpp"
#include "game/commands/PlayerCommand.hpp"
#include "core/commands/ListCommand.hpp"
#include "types/script/ScriptEvent.hpp"

namespace YimMenu::Features
{
	static std::vector<std::pair<int, const char*>> g_Properties = {
	    {1, "日蚀塔，31 号公寓"},
	    {2, "日蚀塔，9 号公寓"},
	    {3, "日蚀塔，40 号公寓"},
	    {4, "日蚀塔，5 号公寓"},
	    {5, "阿尔塔街 3 号，10 号公寓"},
	    {6, "阿尔塔街 3 号，57 号公寓"},
	    {7, "德佩罗高地，20 号公寓"},
	    {8, "鲍尔街 1162 号，3 号公寓"},
	    {9, "西班牙大道 0605 号，1 号公寓"},
	    {10, "拉斯拉古纳斯大道 0604 号，4 号公寓"},
	    {11, "米尔顿路 0184 号，13 号公寓"},
	    {12, "皇家公馆，19 号公寓"},
	    {13, "南莫米尔顿大道 0504 号"},
	    {14, "湾城大道 0115 号，45 号公寓"},
	    {15, "南罗克福德大道 0325 号"},
	    {16, "梦幻塔，15 号公寓"},
	    {17, "拉斯拉古纳斯大道 2143 号，9 号公寓"},
	    {18, "圣维塔斯街 1561 号，2 号公寓"},
	    {19, "南罗克福德大道 0112 号，13 号公寓"},
	    {20, "维斯普奇大道 2057 号，1 号公寓"},
	    {21, "美洲狮大道 0069 号，19 号公寓"},
	    {22, "繁荣街 1237 号，21 号公寓"},
	    {23, "德佩罗大道 1115 号，18 号公寓"},
	    {24, "穆列塔高地 0120 号"},
	    {25, "波普勒街 14 号单元"},
	    {26, "波普勒街 2 号单元"},
	    {27, "供应街 331 号"},
	    {28, "奥林匹克高速 1 号单元"},
	    {29, "罗伊·洛文斯坦大道 0754 号"},
	    {30, "小大角羊大道 12 号"},
	    {31, "波普勒街 124 号单元"},
	    {32, "罗伊·洛文斯坦大道 0552 号"},
	    {33, "戴维斯大道 0432 号"},
	    {34, "德佩罗高地，7 号公寓"},
	    {35, "威索广场，101 号公寓"},
	    {36, "威索广场，70 号公寓"},
	    {37, "威索广场，26 号公寓"},
	    {38, "正直大道 4 号，30 号公寓"},
	    {39, "正直大道 4 号，35 号公寓"},
	    {40, "理查兹尊邸，4 号公寓"},
	    {41, "理查兹尊邸，51 号公寓"},
	    {42, "浮华塔，45 号公寓"},
	    {43, "浮华塔，29 号公寓"},
	    {44, "佩立托大道 142 号"},
	    {45, "草莓大道 1 号"},
	    {46, "葡萄籽大道 1932 号"},
	    {47, "塞诺拉路 1920 号"},
	    {48, "大洋公路 2000 号"},
	    {49, "68 号公路 197 号"},
	    {50, "68 号公路引道 870 号"},
	    {51, "68 号公路 1200 号"},
	    {52, "68 号公路 8754 号"},
	    {53, "戴维斯大道 1905 号"},
	    {54, "南香布尔斯街 1623 号"},
	    {55, "干船坞街 4531 号"},
	    {56, "非凡主义者大道 1337 号"},
	    {57, "格林尼治大道 76 号单元"},
	    {58, "清白大道车库"},
	    {59, "德佩罗大道 634 号"},
	    {60, "镜园大道 0897 号"},
	    {61, "日蚀塔，3 号公寓"},
	    {62, "德佩罗高地，4 号公寓"},
	    {63, "理查兹尊邸，2 号公寓"},
	    {64, "浮华塔，42 号公寓"},
	    {65, "正直大道 4 号，28 号公寓"},
	    {66, "刽子手大道 4 号"},
	    {67, "萨斯坦夏路 12 号"},
	    {68, "普罗科皮奥大道 4584 号"},
	    {69, "普罗科皮奥大道 4401 号"},
	    {70, "佩立托大道 0232 号"},
	    {71, "赞库多大道 140 号"},
	    {72, "葡萄籽大道 1893 号"},
	    {73, "野燕麦大道 3655 号"},
	    {74, "北康克大道 2044 号"},
	    {75, "希尔克雷斯特大道 2868 号"},
	    {76, "希尔克雷斯特大道 2862 号"},
	    {77, "薄雾丘大道 3677 号"},
	    {78, "米尔顿路 2117 号"},
	    {79, "希尔克雷斯特大道 2866 号"},
	    {80, "希尔克雷斯特大道 2874 号"},
	    {81, "疯狂韦恩·雷鸣大道 2113 号"},
	    {82, "北康克大道 2045 号"},
	    {83, "日蚀塔，顶层套房 1"},
	    {84, "日蚀塔，顶层套房 2"},
	    {85, "日蚀塔，顶层套房 3"},
	    {86, "私人游艇"},
	    {87, "隆班克西部"},
	    {88, "花园银行西部"},
	    {89, "阿卡迪厄斯商务中心"},
	    {90, "花园银行大楼"},
	    {91, "兰乔会所"},
	    {92, "德佩罗海滩会所"},
	    {93, "急救箱山会所"},
	    {94, "大灌木丛会所"},
	    {95, "佩立托湾会所"},
	    {96, "沙滩海岸会所"},
	    {97, "拉梅萨会所"},
	    {98, "市中心葡萄园会所"},
	    {99, "霍伊克会所"},
	    {100, "葡萄籽会所"},
	    {101, "佩立托湾会所"},
	    {102, "维斯普奇海滩会所"},
	    {103, "办公室车库 1"},
	    {104, "办公室车库 2"},
	    {105, "办公室车库 3"},
	    {115, "载具仓库"},
	};

	static ListCommand _SelectedProperty{"sendtopropertyindex", "资产", "要将玩家送往的资产", g_Properties, 1};

	class SendToProperty : public PlayerCommand
	{
		using PlayerCommand::PlayerCommand;

		virtual void OnCall(Player player) override
		{
			OnCall(std::vector{player});
		}

		virtual void OnCall(const std::vector<Player>& players) override
		{
			SCRIPT_EVENT_SEND_TO_PROPERTY message;
			message.Owner = Self::GetPlayer().GetId();
			message.PropertyIndex = _SelectedProperty.GetState();
			message.SubProperyIndex = 1;
			message.MissionPassNotify1 = true; // skips some checks
			message.PAD_0004 = -1;
			message.Variation = 1;
			message.Flags = 2; // skips some more checks
			for (auto& player : players)
				message.SetPlayer(player.GetId());
			message.Send();
		}
	};

	static SendToProperty _SendToProperty{"sendtoproperty", "送往资产", "将玩家送往所选资产。"};
}
